tests/fixtures/test_src/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

tests/fixtures/test_src/Catalogs/Пользователи/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ОбновитьПоСпискуПользователейИБ(ТолькоПроверка = Ложь, Удалять = Ложь, ЕстьИзмененные = Ложь) Экспорт
	
	ПользователиИБ = ПользователиИнформационнойБазы.ПолучитьПользователей();
	
	Для Каждого ТекПользовательИБ Из ПользователиИБ Цикл
		
		ТекПользователь = Справочники.Пользователи.НайтиПоРеквизиту("ИдентификаторПользователяИБ",
							ТекПользовательИБ.УникальныйИдентификатор);
							
		Если ЗначениеЗаполнено(ТекПользователь) Тогда
			ТекПользователь = ТекПользователь.ПолучитьОбъект();
		Иначе
			ТекПользователь = Справочники.Пользователи.СоздатьЭлемент();
			ТекПользователь.ИдентификаторПользователяИБ = ТекПользовательИБ.УникальныйИдентификатор;
		КонецЕсли;
		
		ТекПользователь.Наименование = ТекПользовательИБ.ПолноеИмя;
		
		ТекПользователь.Записать();
		
	КонецЦикла;
	
КонецПроцедуры // ОбновитьПоСпискуПользователейИБ()

Функция ТекущийПользователь() Экспорт
	
	ТекущийПользователь = Справочники.Пользователи.ПустаяСсылка();
	
	ТекущийПользователь = Справочники.Пользователи.НайтиПоРеквизиту("ИдентификаторПользователяИБ",
							ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор);
							
	Возврат ТекущийПользователь;
	
КонецФункции // ТекущийПользователь()

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если НЕ Параметры.Отбор.Свойство("Недействителен") Тогда
		Параметры.Отбор.Вставить("Недействителен", Ложь);
	КонецЕсли;
	
	Если НЕ Параметры.Отбор.Свойство("Служебный") Тогда
		Параметры.Отбор.Вставить("Служебный", Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
